# TCP와 UDP의 차이

https://www.notion.so/TCP-UDP-eb3e4e7547af49c58e0e3efa0a55bbd0

### [전송 계층]

![Untitled](https://github.com/ksb3458/SSAFY_CS_Study/blob/main/Subin/%5Bimg%5D/%5Bimg%5D%20TCP%EC%99%80_UDP%EC%9D%98_%EC%B0%A8%EC%9D%B4/Untitled.png)

TCP와 UDP는 OSI 표준모델과 TCP/IP 모델의 **전송 계층**에서 사용되는 프로토콜

상위 계층(*특히* 응용 계층)에서 연결형 서비스와 비연결형 서비스 中 어떤 서비스를 사용할지 결정

⇒ 전송 계층 프로토콜 선택!

<aside>
🍒 **전송 계층**

송신자와 수신자를 연결하는 통신 서비스 제공
패킷(IP에 의해 전달)의 오류 검사
재전송 요구 제어

⇒ 데이터의 전달을 담당하는 계층!

</aside>

### [TCP]

*Transmission Control Protocol, 연결 지향적 프로토콜*

- **신뢰성 있는 데이터 전달**
    
    TCP는 데이터를 송신할 때마다 확인 응답을 주고받는 절차가 있다.
    
    ⇒ 신뢰성 ↑, 속도 ↓
    
    ⇒ 연속성보다 신뢰성 있는 전송이 중요할 때 사용  ex) 파일 전송
    
- **전이중 서비스 제공**
    
    만약 호스트 A의 프로세스와 호스트 B의 프로세스 사이에 TCP 연결이 있다면,
    응용 계층 데이터는 B→A로 흐르는 동시에 A→B로 흐를 수 있음
    
- **점대점(point-to-point) 연결**
    
    항상 단일 송신자와 단일 수신자 사이의 연결
    
- **흐름 제어**
    
    데이터 처리 속도를 조절하여 수신자의 버퍼 오버플로우 방지
    
- **혼잡 제어**
    
    네트워크 내의 패킷 수가 과도하게 증가하지 않도록 방지
    
- **데이터를 세그먼트 단위로 분할하여 전송**
    
    가변 크기
    
- **Client-Server 통신**, **P2P Socket 통신**에서 주로 사용

<aside>
🍒 **연결 지향적**

클라이언트와 서버가 연결된 상태에서 데이터를 주고받는 방식

클라이언트가 연결 요청(SYN 데이터 전송)을 하고, 서버가 연결을 수락하면 통신 선로가 고정되고, 모든 데이터는 고정된 통신 선로를 통해 순차적으로 전달된다!

⇒ TCP는 데이터를 정확하고 안정적으로 전달할 수 있다.

</aside>

### [가상 회선 방식]

TCP는 가상 회선 방식으로 데이터를 전달한다.

> **가상 회선 방식**
> 
> 
> 데이터를 패킷 단위로 나누어 전송하는 방식
> 

![Untitled](https://github.com/ksb3458/SSAFY_CS_Study/blob/main/Subin/%5Bimg%5D/%5Bimg%5D%20TCP%EC%99%80_UDP%EC%9D%98_%EC%B0%A8%EC%9D%B4/Untitled%20(1).png)

- **전송되는 모든 패킷의 경로 동일**
    
    송수신 호스트 사이의 경로는 연결이 설정되는 시점에 한 번만 결정(최적의 경로)되고, 
    이후의 패킷들은 이 경로를 따라 목적지까지 전달되기 때문.
    
    ⇒ 패킷의 출발 순서와 도착 순서가 동일하다!
    
- **연결형 서비스 지원**
    
    패킷을 전송하기 전에 논리적인 연결을 먼저 수행한다.
    

### [UDP]

*User Datagram Protocol, 비연결 지향적 프로토콜*

- **빠른 데이터 전달**
    
    연결을 설정하고 해제하는 과정이 존재하지 않는다.
    
    서로 다른 경로로 데이터를 전송함에도 패킷에 순서를 부여하여 재조립하거나
    흐름 제어, 혼잡 제어를 처리하지 않는다.
    
    ⇒ 속도 ↑, 신뢰성 ↓
    
    ⇒ 신뢰성보다 연속적인 전송이 중요할 때 사용  ex) 실시간 서비스(streaming)
    
- **데이터그램 단위로 처리**
    
    데이터에 UDP 헤더만 붙여 데이터그램 단위로 처리한다.
    (세그먼트 단위로 분할하지 않는다.)
    
- **DNS에서 이용**
    
    DNS는 신뢰성이 중요해 보이지만, UDP를 채택하여 사용한다.
    
    1. 빠른 속도
        
        DNS는 신뢰성보다 속도가 더 중요한 서비스이다.
        
    2. 연결 상태를 유지할 필요 없음
        
        TCP는 호스트 간의 연결 상태를 유지하기 때문에, TCP의 패킷에는 여러 정보가 저장된다.
        
        UDP 패킷에는 정보를 기록하지 않고, 유지할 필요가 없다.
        
        ⇒ 많은 클라이언트를 수용할 수 있다.
        
    3. 작은 DNS 패킷의 크기
        
        UDP는 512 bytes를 넘어가지 않는 패킷만 전송이 가능하다.
        
    4. 응용 계층에서 신뢰성 추가 가능
        
        UDP는 신뢰성을 보장할 수 없으나,
        
        신뢰성은 응용 계층에서 Timeout 추가나, resend 작업을 통해 추가할 수 있다.
        

<aside>
🍒 **비연결 지향적**

연결 절차를 거치지 않고 발신자가 일방적으로 데이터를 발신하는 방식

⇒ UDP는 빠르지만, 데이터 전달의 신뢰성은 낮다.

</aside>

<aside>
🍒 **DNS**

Domain Name System

TCP/IP 네트워크 상에서 문자로 만들어진 도메인을 숫자로 된 IP 주소로 바꾸는 서버

DNS는 응용 계층 프로토콜.
모든 응용 계층 프로토콜은 TCP, UDP 중 하나의 전송 계층 프로토콜을 사용해야 한다.
⇒ UDP 사용!

</aside>

### [데이터그램 방식]

UDP는 데이터그램 방식으로 데이터를 전달한다. 

> **데이터그램 방식**
> 
> 
> 각 전송 패킷을 미리 정해진 경로 없이 독립적으로 처리하여 교환하는 방식
> 

![Untitled](https://github.com/ksb3458/SSAFY_CS_Study/blob/main/Subin/%5Bimg%5D/%5Bimg%5D%20TCP%EC%99%80_UDP%EC%9D%98_%EC%B0%A8%EC%9D%B4/Untitled%20(2).png)

- **패킷별 서로 다른 경로 이용**
    
    같은 목적지의 패킷이라도 서로 다른 경로를 통해서 목적지에 도달한다.
    
    ⇒ 통신망의 한 부분이 혼잡할 때 전송 패킷에 다른 경로 배정 가능
    
    ⇒ 융통성 있는 경로 설정
    
    ⇒ 데이터의 재정렬 기능 필요 (데이터 유실 가능성 존재)
    
- **비연결형 서비스 지원**
    
    연결 절차를 거치지 않는다.
    

### [TCP와 UDP]

- **공통점**
    
    **포트 번호**를 이용하여 주소 지정
    
    데이터 오류검사를 위한 **체크섬(checksum)** 존재
    
    <aside>
    🍒 **UDP와 TCP에서 동일한 포트 번호를 사용한다면?**
    
    각각 별도의 포트 주소 공간을 관리하므로 동일한 포트 번호를 사용해도 무방하다. 
    
    ⇒ 두 프로토콜에서 동일한 포트 번호를 할당해도 서로 다른 포트로 간주한다.
    
    </aside>
    
    <aside>
    🍒 **체크섬 방법**
    
    세그먼트가 출발지로부터 목적지로 이동했을 때, 세그먼트 안 비트에 대한 변경사항이 있는지 검사하는 것.
    
    1. 데이터의 바이트를 16비트 정수 단위로 취해서 더한다.
    2. 더한 값의 1의 보수가 체크섬이 되며, 이를 세그먼트 헤더에 넣어준다.
    3. 수신자는 수신 데이터 합의 1의 보수를 취한 후 그 결과가 모두 1인 비트로 구성되어 있는지 계산한다.
    (한 비트라도 0이 있으면 오류가 발생한 것!)
    
    ⇒ UDP와 TCP에는 자체 체크섬이 존재하여 모든 필드(헤더와 데이터 필드 포함)에 대해 계산된다. *(IP에서는 IP헤더에 대해서만 체크섬이 계산된다.)*
    
    </aside>
    
- **차이점**
    
    **[전송 흐름]**
    
    ![Untitled](https://github.com/ksb3458/SSAFY_CS_Study/blob/main/Subin/%5Bimg%5D/%5Bimg%5D%20TCP%EC%99%80_UDP%EC%9D%98_%EC%B0%A8%EC%9D%B4/Untitled%20(3).png)
    
    TCP는 송신자와 수신자 사이에 계속해서 데이터 수신과 응답을 확인한다.
    
    UDP는 수신자의 응답을 확인하지 않고 데이터를 전송한다.
    
    **[세그먼트 구조]**
    
    > **UDP**
    > 
    > 
    > ![Untitled](https://prod-files-secure.s3.us-west-2.amazonaws.com/93e932aa-238e-4c21-92c0-b3a86388ec72/b5d772d5-3d8a-465c-966e-a8a1e1ab9b61/Untitled.png)
    > 
    > UDP 헤더는 2바이트씩 구성된 단 4개의 필드만을 갖는다.
    > 
    > - 출발지 포트 번호, 목적지 포트 번호 
    > : 정확한 프로세스에게 데이터 전달 (다중화와 역다중화)
    > - 길이 
    > : 헤더를 포함하는 UDP 세그먼트의 길이 (바이트 단위)
    > - 체크섬 
    > : 오류 검출
    > 
    > 애플리케이션 데이터는 데이터 필드에 위치한다.
    > 
    
    > **TCP**
    > 
    > 
    > ![Untitled](https://github.com/ksb3458/SSAFY_CS_Study/blob/main/Subin/%5Bimg%5D/%5Bimg%5D%20TCP%EC%99%80_UDP%EC%9D%98_%EC%B0%A8%EC%9D%B4/Untitled%20(4).png)
    > 
    > TCP 헤더는 일반적으로 20바이트이다.
    > 
    > - 출발지 포트 번호, 목적지 포트 번호, 체크섬
    > - 순서 번호 필드 (32비트), 확인응답 번호 필드 (32비트)
    > : 신뢰적인 데이터 전송 서비스
    > - 수신 윈도 (16비트)
    > : 흐름 제어 (수신자가 받아들이려는 바이트의 크기를 나타냄)
    > - 헤더 길이 필드 (4비트)
    > : 32비트 단위로 TCP 헤더의 길이 표현
    > : TCP 헤더는 가변적인 길이 (옵션 필드 때문)
    > - 옵션 필드
    > - 플래그 필드 (6비트)
    
    **[정리]**

    ![Untitled](https://github.com/ksb3458/SSAFY_CS_Study/blob/main/Subin/%5Bimg%5D/%5Bimg%5D%20TCP%EC%99%80_UDP%EC%9D%98_%EC%B0%A8%EC%9D%B4/Untitled%20(5).png)
